IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    HAL_Delay(CAMERA_SD_CAMERA_RESTORE_DELAY_MS);

    if ((Camera_SnapshotControl_IsSoftwareGuardActive() != 0U) ||
        (s_camera_sd_status.dvp_mask_active != 0U) ||
        (g_camera_dcmi.Instance != DCMI) ||
        (g_camera_dcmi.DMA_Handle != &g_camera_dma) ||
        (g_camera_dcmi.State != HAL_DCMI_STATE_READY) ||
        ((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_PULLUP) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_VERY_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF13))
    {
        result = CAMERA_SD_ERR_CAMERA_RESTORE_FAILED;
    }
    else if ((restore_continuous_capture != 0U) &&
             (((DCMI->CR & DCMI_CR_CAPTURE) == 0U) ||
              ((DMA2_Stream1->CR & DMA_SxCR_EN) == 0U)))
    {
        result = CAMERA_SD_ERR_CAMERA_RESTORE_FAILED;
    }
    else if ((restore_continuous_capture == 0U) &&
             ((DCMI->CR & DCMI_CR_CAPTURE) != 0U))
    {
        result = CAMERA_SD_ERR_CAMERA_RESTORE_FAILED;
    }
    else if ((verify_sdio_inputs != 0U) &&
             ((Camera_SDStorage_GetPinMode(GPIOC, 10U) != 0U) ||
              (Camera_SDStorage_GetPinPull(GPIOC, 10U) != GPIO_NOPULL) ||
              (Camera_SDStorage_GetPinMode(GPIOC, 12U) != 0U) ||
              (Camera_SDStorage_GetPinPull(GPIOC, 12U) != GPIO_NOPULL) ||
              (Camera_SDStorage_GetPinMode(GPIOD, 2U) != 0U) ||
              (Camera_SDStorage_GetPinPull(GPIOD, 2U) != GPIO_NOPULL)))
    {
        result = CAMERA_SD_ERR_CAMERA_RESTORE_FAILED;
    }

    return result;
}

static void Camera_SDStorage_PrepareSdHandle(void)
{
    s_camera_sd_handle.Instance = SDIO;
    s_camera_sd_handle.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    s_camera_sd_handle.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    s_camera_sd_handle.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    s_camera_sd_handle.Init.BusWide = SDIO_BUS_WIDE_1B;
    s_camera_sd_handle.Init.HardwareFlowControl =
        SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
    s_camera_sd_handle.Init.ClockDiv = CAMERA_SD_INIT_CLOCK_DIV;
}

static void Camera_SDStorage_EnableSdioClock(void)
{
    __HAL_RCC_SDIO_CLK_ENABLE();
    s_camera_sd_clock_enabled = 1U;
}

static void Camera_SDStorage_DisableSdioClock(void)
{
    __HAL_RCC_SDIO_CLK_DISABLE();
    s_camera_sd_clock_enabled = 0U;
}

void Camera_SDStorage_InitState(void)
{
    memset(&s_camera_sd_status, 0, sizeof(s_camera_sd_status));
    memset(&s_camera_sd_handle, 0, sizeof(s_camera_sd_handle));
    memset(&s_camera_sd_card_info, 0, sizeof(s_camera_sd_card_info));
    memset(&s_camera_sd_fatfs, 0, sizeof(s_camera_sd_fatfs));
    memset(&s_camera_sd_file, 0, sizeof(s_camera_sd_file));
    memset(
        s_camera_sd_candidate_file_name,
        0,
        sizeof(s_camera_sd_candidate_file_name));
    memset(
        s_camera_sd_last_file_name,
        0,
        sizeof(s_camera_sd_last_file_name));
    (void)memcpy(
        s_camera_sd_last_file_name,
        CAMERA_SD_NO_FILE_NAME_TEXT,
        sizeof(CAMERA_SD_NO_FILE_NAME_TEXT));

    s_camera_sd_status.supported = 1U;
    s_camera_sd_status.takeover_required = 1U;
    s_camera_sd_status.dvp_mask_available = 1U;
    s_camera_sd_status.dvp_reg_3018_saved =
        CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.dvp_reg_3018_current_or_restored =
        CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.last_mount_result =
        CAMERA_SD_FATFS_MOUNT_NOT_RUN;
    s_camera_sd_status.last_mount_text = "NOT_RUN";
    s_camera_sd_status.last_snapshot_text = "NOT_RUN";
    s_camera_sd_status.last_file_name = s_camera_sd_last_file_name;
    s_camera_sd_status.last_file_size = 0U;
    s_camera_sd_status.save_count = 0U;
    s_camera_sd_status.last_total_ms = 0U;
    s_camera_sd_status.last_write_ms = 0U;
    s_camera_sd_status.last_sd_init_status = CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.last_sd_init_error = CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.last_sd_rw_status = CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_status.last_sd_rw_error = CAMERA_SD_REG_VALUE_UNKNOWN;
    s_camera_sd_full_gpio_af12_selected = 0U;
    s_camera_sd_clock_enabled = 0U;
    s_camera_sd_hal_init_attempted = 0U;
    s_camera_sd_card_info_valid = 0U;
    s_camera_sd_fatfs_session_active = 0U;
    s_camera_sd_fatfs_write_allowed = 0U;
    s_camera_sd_fatfs_disk_error = CAMERA_SD_OK;
    Camera_SDStorage_SetSaveError(CAMERA_SD_OK);
    Camera_SDStorage_SetLastError(CAMERA_SD_OK);
}

void Camera_SDStorage_GetStatus(CameraSdStorageStatus_t *status)
{
    if (status != NULL)
    {
        *status = s_camera_sd_status;
    }
}

uint32_t Camera_SDStorage_StopDvpConflictPads(void)
{
    uint32_t result = CAMERA_SD_OK;
    uint8_t register_value = 0U;
    uint8_t masked_value;

    if (Camera_SnapshotControl_IsTakeoverPreconditionReady() == 0U)
    {
        result = CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
    }
    else if (SCCB_ReadReg(
                 CAMERA_SD_DVP_PAD_OUTPUT_ENABLE02_REG,
                 &register_value) != 0U)
    {
        result = CAMERA_SD_ERR_SENSOR_REG_READ_FAILED;
    }
    else
    {
        if (s_camera_sd_status.dvp_mask_active == 0U)
        {
            s_camera_sd_status.dvp_reg_3018_saved = register_value;
        }
        s_camera_sd_status.dvp_reg_3018_current_or_restored = register_value;

        masked_value = (uint8_t)(
            register_value & CAMERA_SD_DVP_CONFLICT_PAD_KEEP_MASK);
        if (SCCB_WriteReg(
                CAMERA_SD_DVP_PAD_OUTPUT_ENABLE02_REG,
                masked_value) != 0U)
        {
            result = CAMERA_SD_ERR_SENSOR_REG_WRITE_FAILED;
        }
        else
        {
            HAL_Delay(5U);
            if (SCCB_ReadReg(
                    CAMERA_SD_DVP_PAD_OUTPUT_ENABLE02_REG,
                    &register_value) != 0U)
            {
                result = CAMERA_SD_ERR_SENSOR_REG_READ_FAILED;
            }
            else
            {
                s_camera_sd_status.dvp_reg_3018_current_or_restored =
                    register_value;
                if (register_value != masked_value)
                {
                    result = CAMERA_SD_ERR_SENSOR_REG_VERIFY_FAILED;
                }
            }
        }
    }

