IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
uint32_t Camera_SDStorage_FatFsDiskWrite(
    const uint8_t *buffer,
    uint32_t sector,
    uint32_t count)
{
    HAL_StatusTypeDef hal_status;
    uint32_t result;

    if ((buffer == NULL) || (count == 0U))
    {
        result = CAMERA_SD_ERR_INVALID_ARGUMENT;
    }
    else if ((s_camera_sd_fatfs_session_active == 0U) ||
             (s_camera_sd_fatfs_write_allowed == 0U) ||
             (s_camera_sd_status.sdio_ready == 0U) ||
             (s_camera_sd_card_info_valid == 0U))
    {
        result = CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
    }
    else
    {
        result = Camera_SDStorage_WaitForCardTransfer();
        if (result == CAMERA_SD_OK)
        {
            hal_status = HAL_SD_WriteBlocks(
                &s_camera_sd_handle,
                (uint8_t *)buffer,
                sector,
                count,
                CAMERA_SD_FATFS_WRITE_TIMEOUT_MS);
            s_camera_sd_status.last_sd_rw_status = (uint32_t)hal_status;
            s_camera_sd_status.last_sd_rw_error =
                HAL_SD_GetError(&s_camera_sd_handle);
            if (hal_status != HAL_OK)
            {
                result = CAMERA_SD_ERR_FATFS_DISK_WRITE_FAILED;
            }
            else
            {
                result = Camera_SDStorage_WaitForCardTransfer();
            }
        }
    }

    if (result != CAMERA_SD_OK)
    {
        s_camera_sd_fatfs_disk_error = result;
        Camera_SDStorage_SetSaveError(result);
        Camera_SDStorage_SetLastError(result);
    }
    return result;
}

uint32_t Camera_SDStorage_FatFsDiskIoctl(uint8_t command, void *buffer)
{
    uint32_t result = CAMERA_SD_OK;

    if ((s_camera_sd_fatfs_session_active == 0U) ||
        (s_camera_sd_status.sdio_ready == 0U) ||
        (s_camera_sd_card_info_valid == 0U))
    {
        result = CAMERA_SD_ERR_FATFS_DISK_NOT_READY;
    }
    else if (command == CTRL_SYNC)
    {
        result = Camera_SDStorage_WaitForCardTransfer();
    }
    else if (buffer == NULL)
    {
        result = CAMERA_SD_ERR_INVALID_ARGUMENT;
    }
    else
    {
        switch (command)
        {
            case GET_SECTOR_COUNT:
                *((uint32_t *)buffer) = s_camera_sd_card_info.LogBlockNbr;
                break;

            case GET_SECTOR_SIZE:
                *((uint16_t *)buffer) =
                    (uint16_t)s_camera_sd_card_info.LogBlockSize;
                break;

            case GET_BLOCK_SIZE:
                *((uint32_t *)buffer) = 1U;
                break;

            default:
                result = CAMERA_SD_ERR_FATFS_DISK_IOCTL_FAILED;
                break;
        }
    }

    if (result != CAMERA_SD_OK)
    {
        s_camera_sd_fatfs_disk_error = result;
    }
    return result;
}

uint32_t Camera_SDStorage_CheckFatfsMount(void)
{
    uint32_t result = CAMERA_SD_OK;
    uint32_t step_result;
    uint32_t prepare_attempted = 0U;
    uint32_t dvp_restore_required = 0U;
    uint32_t takeover_attempted = 0U;
    uint32_t mount_attempted = 0U;
    uint32_t restore_continuous_capture;
    FRESULT mount_result;

    s_camera_sd_status.card_ready = 0U;
    s_camera_sd_status.fatfs_ready = 0U;
    s_camera_sd_status.last_mount_result =
        CAMERA_SD_FATFS_MOUNT_NOT_RUN;
    s_camera_sd_status.last_mount_text = "NOT_RUN";
    s_camera_sd_fatfs_disk_error = CAMERA_SD_OK;

    if ((Camera_SnapshotControl_IsSoftwareGuardActive() != 0U) ||
        (s_camera_sd_fatfs_session_active != 0U) ||
        (s_camera_sd_full_gpio_af12_selected != 0U) ||
        (s_camera_sd_clock_enabled != 0U) ||
        (s_camera_sd_status.dvp_mask_active != 0U))
    {
        result = CAMERA_SD_ERR_SNAPSHOT_BUSY;
        Camera_SDStorage_SetLastError(result);
        return result;
    }

    s_camera_sd_status.dvp_reg_3018_saved =
        CAMERA_SD_REG_VALUE_UNKNOWN;
    restore_continuous_capture =
        ((DCMI->CR & DCMI_CR_CAPTURE) != 0U) ? 1U : 0U;
    Camera_SDStorage_EnsureDcmiDmaHandle();
    prepare_attempted = 1U;
    step_result = Camera_SnapshotControl_RequestPrepare();
    if (step_result != CAMERA_SNAPSHOT_OK)
    {
        result = CAMERA_SD_ERR_SNAPSHOT_PREPARE_FAILED;
        goto cleanup;
    }

    step_result = Camera_SDStorage_StopDvpConflictPads();
    if (s_camera_sd_status.dvp_reg_3018_saved !=
        CAMERA_SD_REG_VALUE_UNKNOWN)
    {
        dvp_restore_required = 1U;
    }
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    takeover_attempted = 1U;
    step_result = Camera_SDStorage_RequestTakeoverEnter();
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    step_result = Camera_SDStorage_RequestInit();
    if (step_result != CAMERA_SD_OK)
    {
        result = step_result;
        goto cleanup;
    }

    s_camera_sd_fatfs_session_active = 1U;
    mount_attempted = 1U;
    mount_result = f_mount(&s_camera_sd_fatfs, "", 1U);
    Camera_SDStorage_SetMountResult(mount_result);
    if (mount_result != FR_OK)
    {
        result = (s_camera_sd_fatfs_disk_error != CAMERA_SD_OK) ?
            s_camera_sd_fatfs_disk_error :
            CAMERA_SD_ERR_FATFS_MOUNT_FAILED;
        goto cleanup;
    }

    s_camera_sd_status.fatfs_ready = 1U;

cleanup:
    if (mount_attempted != 0U)
    {
        mount_result = f_mount(NULL, "", 0U);
        if (mount_result != FR_OK)
        {
            Camera_SDStorage_RecordFirstError(
                &result,
                CAMERA_SD_ERR_FATFS_UNMOUNT_FAILED);
        }
        s_camera_sd_status.fatfs_ready = 0U;
    }
    s_camera_sd_fatfs_session_active = 0U;

    if (takeover_attempted != 0U)
    {
        step_result = Camera_SDStorage_RequestTakeoverExit();
        Camera_SDStorage_RecordFirstError(&result, step_result);
    }

    if (dvp_restore_required != 0U)
    {
        step_result = Camera_SDStorage_RestoreDvpConflictPads();
        Camera_SDStorage_RecordFirstError(&result, step_result);
    }

    if (prepare_attempted != 0U)
    {
        step_result = Camera_SDStorage_RestoreCameraLink(
            restore_continuous_capture,
            takeover_attempted);
        Camera_SDStorage_RecordFirstError(&result, step_result);
    }

    s_camera_sd_status.card_ready =
        (result == CAMERA_SD_OK) ? 1U : 0U;
    Camera_SDStorage_SetLastError(result);
    return result;
}

static uint32_t Camera_SDStorage_GetValidatedFrontFrame(
    CameraFrame_t *front_frame)
{
    if ((front_frame == NULL) ||
        (Camera_FrameBuffer_GetFrontFrame(front_frame) != CAMERA_FB_OK) ||
        (front_frame->data == NULL) ||
        (front_frame->width != CAMERA_FB_WIDTH) ||
        (front_frame->height != CAMERA_FB_HEIGHT) ||
        (front_frame->size_bytes != CAMERA_FB_SIZE_BYTES) ||
        (front_frame->size_bytes !=
         ((uint32_t)front_frame->width *
          (uint32_t)front_frame->height *
          CAMERA_FB_BYTES_PER_PIXEL)))
    {
        return CAMERA_SD_ERR_FRAME_BUFFER_INVALID;
    }

    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_StageFrontFrame(
    uint32_t *source_nonzero,
    uint32_t *source_sum32)
{
    CameraFrame_t front_frame;
    uint32_t nonzero_count = 0U;
    uint32_t sum32 = 0U;
    uint32_t index;
    uint32_t result;

    if ((source_nonzero == NULL) || (source_sum32 == NULL))
    {
        return CAMERA_SD_ERR_INVALID_ARGUMENT;
    }

    result = Camera_SDStorage_GetValidatedFrontFrame(&front_frame);
    if (result != CAMERA_SD_OK)
    {
        return result;
    }

    (void)memcpy(
        s_camera_sd_snapshot_image_buffer,
        front_frame.data,
        CAMERA_FB_SIZE_BYTES);

    for (index = 0U; index < CAMERA_FB_SIZE_BYTES; ++index)
    {
        uint8_t value = s_camera_sd_snapshot_image_buffer[index];

        sum32 += (uint32_t)value;
        if (value != 0U)
        {
            ++nonzero_count;
        }
    }

